In [1]:
import psycopg2
import pandas as pd
import re

In [2]:
df=pd.read_csv('IMDB Movie Titles.csv',encoding='1251')

In [3]:
df.head()

   Movie ID                                     Movie Name
0         8  Edison Kinetoscopic Record of a Sneeze (1894)
1        91                     Le manoir du diable (1896)
2       417                  Le voyage dans la lune (1902)
3       628                        The  s of Dollie (1908)
4       833                      The Country Doctor (1909)

In [23]:
df['Movie Year']=df[' Movie Name'].apply(lambda x: ';'.join(re.findall('\((\d{4})\)',x))).replace({'':pd.np.nan}).astype(float)

In [24]:
df.head()

   Movie ID                                     Movie Name  Movie Year
0         8  Edison Kinetoscopic Record of a Sneeze (1894)      1894.0
1        91                     Le manoir du diable (1896)      1896.0
2       417                  Le voyage dans la lune (1902)      1902.0
3       628                        The  s of Dollie (1908)      1908.0
4       833                      The Country Doctor (1909)      1909.0

In [25]:
df[' Movie Name']=df[' Movie Name'].apply(lambda x: re.sub(' \(.*','',x).strip())

In [26]:
df.head()

   Movie ID                              Movie Name  Movie Year
0         8  Edison Kinetoscopic Record of a Sneeze      1894.0
1        91                     Le manoir du diable      1896.0
2       417                  Le voyage dans la lune      1902.0
3       628                        The  s of Dollie      1908.0
4       833                      The Country Doctor      1909.0

In [28]:
df.isnull().values.any()

True

In [29]:
df['Movie Year']=df['Movie Year'].fillna(0)

In [32]:
df['Movie Year']=df['Movie Year'].astype(int)

In [33]:
df.head()

   Movie ID                              Movie Name  Movie Year
0         8  Edison Kinetoscopic Record of a Sneeze        1894
1        91                     Le manoir du diable        1896
2       417                  Le voyage dans la lune        1902
3       628                        The  s of Dollie        1908
4       833                      The Country Doctor        1909

In [34]:
con=psycopg2.connect(user='developer', password='rtfP@ssw0rd', host='84.201.147.162', dbname='information_retrieval')

In [35]:
cur=con.cursor()

In [40]:
cur.executemany('insert into movies values(%s, %s, %s)', df.values)

IntegrityError: duplicate key value violates unique constraint "movies_pkey"
DETAIL:  Key (id)=(8) already exists.

In [ ]:
con.commit()

cur.close()
con.close()

In [1]:
import lucene
print(lucene.VERSION)

7.7.1